Revit 2027 API
Application.NewProjectDocument(String) Method
 New project document
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual Document NewProjectDocument(
	string templateFileName
)
Public Overridable Function NewProjectDocument (
	templateFileName As String
) As Document
public:
virtual Document^ NewProjectDocument(
	String^ templateFileName
)
abstract NewProjectDocument :
        templateFileName : string -> Document
override NewProjectDocument :
        templateFileName : string -> Document
Parameters
templateFileName String
The template file name.
Return Value
Document
Exceptions
Exception | Condition
ArgumentException | If 'templateFileName' is null or an empty string.
InvalidOperationException | If the new project document cannot be created.
Remarks
 This command corresponds to New->Project command in the user-interface.
See Also
Reference
Application Class
NewProjectDocument Overload
Autodesk.Revit.ApplicationServices Namespace